In [2]:
import pandas as pd
import numpy as np

# csv read

In [3]:
article_read = pd.read_csv('/home/matu/Pandas/pandas_tutorial_read.csv', delimiter = ';', 
            names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

In [9]:
article_read.head()

           my_datetime event    country     user_id   source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America

# DataFrame

In [3]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],

     index=['cobra', 'viper', 'sidewinder'],

     columns=['max_speed', 'shield'])

In [8]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

# select specific columns:
**Note using [ [ ] ] returns a DataFrame. Using [ ] returns a Series

In [10]:
#the outer bracket frames tell pandas that you want to select columns, and the inner brackets are for the list
article_read[['country', 'user_id']].head()

     country     user_id
0  country_7  2458151261
1  country_7  2458151262
2  country_7  2458151263
3  country_7  2458151264
4  country_8  2458151265

In [16]:
article_read.country.head()

0    country_7
1    country_7
2    country_7
3    country_7
4    country_8
Name: country, dtype: object

In [13]:
df['shield']

cobra         2
viper         5
sidewinder    8
Name: shield, dtype: int64

In [14]:
df.shield

cobra         2
viper         5
sidewinder    8
Name: shield, dtype: int64

# Select Specific Rows  - loc, iloc
**loc is label-based

**iloc is integer position-based

In [17]:
article_read.loc[1]

my_datetime    2018-01-01 00:03:20
event                         read
country                  country_7
user_id                 2458151262
source                         SEO
topic                South America
Name: 1, dtype: object

In [18]:
df.loc[['viper']]

       max_speed  shield
viper          4       5

In [4]:
df.loc[['viper']][['shield']]

       shield
viper       5

In [27]:
df.iloc[1]

max_speed    4
shield       5
Name: viper, dtype: int64

# Overwrite 1 cell

In [ ]:
#df.at['row', 'column'] = value
df.at['cobra', 'max_speed'] = 100

# Bool comper

In [29]:
article_read.source == 'SEO'

0        True
1        True
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11       True
12      False
13      False
14      False
15       True
16       True
17      False
18       True
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26       True
27       True
28      False
29      False
        ...
1765    False
1766    False
1767    False
1768    False
1769    False
1770    False
1771    False
1772     True
1773    False
1774    False
1775    False
1776    False
1777     True
1778    False
1779     True
1780    False
1781    False
1782    False
1783    False
1784     True
1785    False
1786    False
1787    False
1788    False
1789    False
1790    False
1791     True
1792    False
1793    False
1794    False
Name: source, Length: 1795, dtype: bool

In [31]:
df[['max_speed']] == 4

            max_speed
cobra           False
viper            True
sidewinder      False

# Where, filter

In [32]:
article_read[article_read.source == 'SEO'].head()

            my_datetime event    country     user_id source          topic
0   2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1   2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11  2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15  2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16  2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America

In [44]:
df[df.shield > 3]

            max_speed  shield
viper               4       5
sidewinder          7       8

# Count , sum, min, max, mean, median

In [50]:
df.count()

max_speed    3
shield       3
dtype: int64

In [52]:
article_read['user_id'].count()

1795

In [53]:
article_read.sum()

my_datetime    2018-01-01 00:01:012018-01-01 00:03:202018-01-...
event          readreadreadreadreadreadreadreadreadreadreadre...
country        country_7country_7country_7country_7country_8c...
user_id                                            4412383123610
source         SEOSEOAdWordsAdWordsRedditRedditRedditAdWordsA...
topic          North AmericaSouth AmericaAfricaEuropeNorth Am...
dtype: object

In [54]:
article_read.min()

my_datetime    2018-01-01 00:01:01
event                         read
country                  country_1
user_id                 2458151261
source                     AdWords
topic                       Africa
dtype: object

In [55]:
article_read.user_id.mean()

2458152158.0

In [57]:
article_read[['user_id']].median()

user_id    2.458152e+09
dtype: float64

# Grouping

In [60]:
article_read.groupby('country')

In [69]:
article_read.groupby('country').min().user_id.head()  #series
#groupby-olom az alapján amire kíváncsi vagyok majd végezhető a művelet egy másik adaton

country
country_1    2458151351
country_2    2458151267
country_3    2458151313
country_4    2458151279
country_5    2458151270
Name: user_id, dtype: int64

In [73]:
article_read.groupby('source').count()[['user_id']] #Dataframe

         user_id
source
AdWords      500
Reddit       949
SEO          346

# Merge

In [5]:
zoo = pd.read_csv('/home/matu/Pandas/zoo.csv', delimiter = ',')
zoo_eats = pd.read_csv('/home/matu/Pandas/zoo_eats.csv', delimiter = ';')

In [81]:
#Merge   - automatic recognize if posible
zoo.merge(zoo_eats).head()

     animal  uniq_id  water_need        food
0  elephant     1001         500  vegetables
1  elephant     1002         600  vegetables
2  elephant     1003         550  vegetables
3     tiger     1004         300        meat
4     tiger     1005         320        meat

In [84]:
#inner, outer, left, right - there are nan values
zoo.merge(zoo_eats, how = 'outer')

      animal  uniq_id  water_need        food
0   elephant   1001.0       500.0  vegetables
1   elephant   1002.0       600.0  vegetables
2   elephant   1003.0       550.0  vegetables
3      tiger   1004.0       300.0        meat
4      tiger   1005.0       320.0        meat
5      tiger   1006.0       330.0        meat
6      tiger   1007.0       290.0        meat
7      tiger   1008.0       310.0        meat
8      zebra   1009.0       200.0  vegetables
9      zebra   1010.0       220.0  vegetables
10     zebra   1011.0       240.0  vegetables
11     zebra   1012.0       230.0  vegetables
12     zebra   1013.0       220.0  vegetables
13     zebra   1014.0       100.0  vegetables
14     zebra   1015.0        80.0  vegetables
15      lion   1016.0       420.0         NaN
16      lion   1017.0       600.0         NaN
17      lion   1018.0       500.0         NaN
18      lion   1019.0       390.0         NaN
19  kangaroo   1020.0       410.0  vegetables
20  kangaroo   1021.0       430.0  vegetables
21  kangaroo   1022.0       410.0  vegetables
22   giraffe      NaN         NaN  vegetables

In [ ]:
#join on:

zoo.merge(zoo_eats, how = 'left', left_on = 'animal', right_on = 'animal')

# Sorting, reset index, fillNA

In [86]:
zoo.sort_values('water_need').head()

   animal  uniq_id  water_need
14  zebra     1015          80
13  zebra     1014         100
8   zebra     1009         200
9   zebra     1010         220
12  zebra     1013         220

In [ ]:
zoo.sort_values(by = ['animal', 'water_need'], ascending = False)

In [88]:
#reset index

zoo.sort_values(by = ['animal', 'water_need'], ascending = False).reset_index().head()

   index animal  uniq_id  water_need
0     10  zebra     1011         240
1     11  zebra     1012         230
2      9  zebra     1010         220
3     12  zebra     1013         220
4      8  zebra     1009         200

In [ ]:
#drop the old indexes
zoo.sort_values(by = ['animal', 'water_need'], ascending = False).reset_index(drop = True)

In [7]:
#fillNA
zoo.merge(zoo_eats, how = 'left').fillna('meat').head()

     animal  uniq_id  water_need        food
0  elephant     1001         500  vegetables
1  elephant     1002         600  vegetables
2  elephant     1003         550  vegetables
3     tiger     1004         300        meat
4     tiger     1005         320        meat

# Sample

In [76]:
#select source, topic, count(*)
#from article_read
#WHERE country = 'country_2'
#group by source, topic

article_read[article_read.country == 'country_2'].groupby(['source', 'topic']).count()[['user_id']].head()

                       user_id
source  topic
AdWords Africa               3
        Asia                31
        Australia            6
        Europe              46
        North America       11